# Python Intro - Final Exercise

In [2]:
import pyodbc
import pandas as pd
import numpy as np

In [3]:
### In windows, Using a ODBC DNS (predefined connection name)
conn = pyodbc.connect("DSN=College;"
                      "Server=DESKTOP-E6QQ4LT\SQLEXPRESS;"
                      "Database=College;"
                      "Trusted_Connection=yes;")

In [4]:
### Get the students table
students = pd.read_sql("SELECT * FROM Students;",conn) 
students.head(0)

Empty DataFrame
Columns: [Student_id, First_name, Last_name, Gender]
Index: []

In [5]:
departments = pd.read_sql("SELECT * FROM Departments;",conn)
departments.head(0)

Empty DataFrame
Columns: [Department_id, Department_name]
Index: []

In [6]:
courses = pd.read_sql("SELECT * FROM Courses;",conn)
courses.head(0)

Empty DataFrame
Columns: [Course_id, Course_name, Department_id, Teacher_id]
Index: []

In [7]:
classroom = pd.read_sql("SELECT * FROM Classroom;",conn)
classroom.head(0)

Empty DataFrame
Columns: [Course_id, Student_id, Degree]
Index: []

In [9]:
teachers = pd.read_sql("SELECT * FROM Teachers;",conn)
teachers.head(0)

Empty DataFrame
Columns: [Teacher_id, First_name, Last_name, Gender]
Index: []

# 1. Count the number of students on each department

In [12]:
#inner join classroom with courses
classroom_courses = pd.merge(classroom, 
                             courses[['Course_id', 'Course_name', 'Department_id']], 
                             on='Course_id')

#inner join classroom_courses with departments 
classroom_courses_departments = pd.merge(classroom_courses,
                                        departments[['Department_id', 'Department_name']],
                                        on='Department_id')

#counting the number of students in each department
classroom_courses_departments.groupby('Department_id').agg({'Student_id': pd.Series.nunique})

               Student_id
Department_id
1                      84
2                     200
3                     137
4                      81

# 2. How many students have each course of the English department and the total number of students in the department?

In [13]:
# selecting only the English department
english_dep=classroom_courses_departments[classroom_courses_departments.Department_id<2]

#counting the number of student in each course
english_dep.groupby(['Department_id','Course_name']).agg({'Student_id': pd.Series.nunique})

                                    Student_id
Department_id Course_name
1             Advanced English              24
              English Begginers             32
              Proffesional English          38

In [14]:
#counting total student in the english department
TotalStudent = english_dep.groupby('Department_id').agg({'Student_id': pd.Series.nunique})
TotalStudent

               Student_id
Department_id
1                      84

# 3. How many small (<22 students) and large (22+ students) classrooms are needed for the Science department?

In [15]:
#selecting the Science department and agg. the student in each course
science_class =  classroom_courses_departments[classroom_courses_departments.Department_id.isin([2])].\
groupby(['Department_id','Course_id']).\
agg({'Student_id':pd.Series.nunique }) 
science_class.columns=['TotalInClass']


#class size by categ
science_class_cat = science_class.copy()
science_class_cat['ClassSize'] = ''
science_class_cat.loc[(science_class_cat['TotalInClass']< 22),'ClassSize']='Small'
science_class_cat.loc[(science_class_cat['TotalInClass']> 21),'ClassSize']='Big'


#counting the number of each class size
science_class_cat.groupby('ClassSize').agg({'ClassSize':['count']})

          ClassSize
              count
ClassSize
Big              10
Small             6

# 4. A feminist student claims that there are more male than female in the College. Justify if the argument is correct

In [16]:
#counting the number of each gender 
students.groupby('Gender').agg({'Gender':['count']})

       Gender
        count
Gender
F         165
M         115

# 5. For which courses the percentage of male/female students is over 70%?

In [17]:
#join classroom_courses with students
courses_classroom_students = pd.merge(classroom_courses,
                            students[['Gender','Student_id']],
                            on='Student_id')

#agg of student gender per course
corse_gender = courses_classroom_students.copy()
corse_gender = corse_gender.groupby(['Course_name','Gender']).\
agg({'Student_id':pd.Series.nunique})
corse_gender.columns=['TotalGender']

#creating a new column containing the total per course
corse_gender['TotalInClass'] = corse_gender.groupby('Course_name').transform('sum')

#creating a new column containing the percentage
corse_gender['Percent'] = corse_gender.TotalGender / corse_gender.TotalInClass

#selecting the >70% courses
corse_gender = corse_gender[corse_gender.Percent>0.7]
corse_gender.head(10)

                    TotalGender  TotalInClass   Percent
Course_name Gender
Genetics    F                26            37  0.702703
Sculpture   F                17            23  0.739130
Tenis       F                13            18  0.722222

## Q6. For each department, how many students passed with a grades over 80?

In [18]:
#merge of class with courses
classroom_courses_degree = pd.merge(classroom, 
                             courses[['Course_id', 'Course_name', 'Department_id']], 
                             on='Course_id')

#selecting the student who have grade over 80
degree_80 = classroom_courses_degree[classroom_courses_degree.Degree>80]

#counting the student
degree_80 = degree_80.groupby('Department_id').agg({'Student_id':pd.Series.nunique})
degree_80.head()

               Student_id
Department_id
1                      40
2                     122
3                      61
4                      39

## Q7. For each department, how many students passed with a grades under 60?

In [19]:
#selecting the student who have grade under 60
degree_60 = classroom_courses_degree[classroom_courses_degree.Degree<60]

#counting the student
degree_60 = degree_60.groupby('Department_id').agg({'Student_id':pd.Series.nunique})
degree_60.head(10)

               Student_id
Department_id
1                       2
2                       7
3                       3
4                       1

# 8. Rate the teachers by their average student's grades (in descending order).

In [77]:
#merging courses with teachers
classroom_courses_teacher = pd.merge(teachers,
                         courses[['Teacher_id','Course_id']],
                         on='Teacher_id')
#merging with classroom
teacher_degree = pd.merge(classroom_courses_teacher,
                          classroom[['Course_id','Student_id','Degree']],
                          on='Course_id')

#calculting the avarage of each teacher
teacher_deg = teacher_degree.groupby(['Teacher_id']).agg({'Degree':'mean'})
teacher_deg.head(25)

               Degree
Teacher_id
1           79.365537
2           76.899881
3           80.729494
5           80.440242
6           77.743575
8           75.955453
9           77.406852
10          78.383348
11          76.765296
12          77.134323
13          75.668139
14          76.737973
15          78.699492
16          76.516464
17          78.443395
18          78.908281
19          78.495479
20          79.365867
21          78.316150
22          81.432703
23          78.673509
24          78.814631

## Q9. Create a dataframe showing the courses, departments they are associated with, the teacher in each course, and the number of students enrolled in the course (for each course, department and teacher show the names).

## Q10. Create a dataframe showing the students, the number of courses they take, the average of the grades per class, and their overall average (for each student show the student name).